app/Models/ModelUser.php

SELECT *
FROM `user`
---
    public function Alldata()
    {
        return $this->db->table('user')->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `user`
---
    public function JumlahData()
    {
        return $this->db->table('user')->countAll();

SELECT *
FROM `user`
WHERE `nama_user` = 'zul'
AND `password` = '8cb2237d0679ca88db6464eac60da96345513964'
---
    public function LoginUser ($nama_user,$password)
    {
     return $this->db->table('user')
     ->where([
         'nama_user' => $nama_user,
        //  'email' => $email,
         'password' => $password,
     ])->get()->getRowArray();