app/Models/ModelKost.php

SELECT *
FROM `kost`
---
    public function data()
    {
        return $this->db->table('kost')->get()->getResultArray();

SELECT *
FROM `kost`
WHERE `id_user` IS NULL
ORDER BY `id_kost` DESC
---
   public function AllData($id_user)
   {
    return $this->db->table('kost')
    ->where('id_user', $id_user)
    ->orderBy('id_kost', 'DESC')
    ->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `kost`
---
   public function JumlahData()
    {
        return $this->db->table('kost')->countAll();

SELECT *
FROM `kost`
WHERE `slug` = 'kost-rahman'
---
    public function detail($slug = false)
    {
      if ($slug == false) {
        return $this->db->table('kost')->get()->getResultArray();
      }

      return $this->db->table('kost')->where(['slug' => $slug])->get()->getRow();